# PYTHON INTRODUCTION

#                                                      Table Of Content 
1.introdution 

     1.1 What is Python
     1.2 Installation of tools
     
2.Data types

     2.1 variables
     2.2 Numbers
     2.3 Strings
     2.4 Lists
     2.5 Dictionaries
     2.6 Tuples
     2.7 Sets
   
3.Comparison operators 

4.If-Else statement

5.For Loop

6.While loop

7.Functions

8.Lambda functions

     8.1 Map()
     8.2 Filter()
   
9.File I/O

10.Pandas liberary introduction

11.Series

     11.1 From ndarray
     11.2 From dict
     11.3 From scalar value
     11.4 Series is ndarray-like
     11.5 Series is dict-like
     11.6 Vectorized operations and label alignment with series 
     11.7 Name attributes 
   
12.Data frames 

     12.1 From dict of series or dicts
     12.2 from dict of ndarrays/lists
     12.3 from a list of dicts 
     12.4 from a list of tuples 
     12.5

# 1. Introduction

## 1.1 What is python

Guido Van Rossum developed the Python language in the late 1980s. In contrast to other popular languages such as C, C++, Java, and C#, Python strives to provide a simple but powerful syntax.It is open source general purpose language with great interactive environment.It provides all the three types of programming features Object Oriented, Procedural and Functional.It is used by many of the most highly productive professional programmers.Moreover, Python can also become a common language for production of web based analytics product. A few of the places that use Python extensively are Google, the New York Stock Exchange, Industrial Light,Magic etc.
#### Important features of Python:
 -  Built-in high level data types: strings, lists, dictionaries, etc.
 -  The usual control structures: if, if-else, if-elif-else, while, plus a powerful collection iterator (for).
 -  Multiple levels of organizational structure: functions, classes, modules, and  packages. These assist in organizing code. An excellent and large example is the Python standard library.
 - Compile on the fly to byte code -- Source code is compiled to byte code without a separate compile step. Source code modules can also be "pre-compiled" to byte code files.
 - Object-oriented -- Python provides a consistent way to use objects: everything is an object. And, in Python it is easy to implement new object types (called classes in object-oriented programming).
 - Extensions in C and C++ -- Extension modules and extension types can be written by hand. There are also tools that help with this, for example, SWIG, sip, Pyrex

## 1.2. Installation of tools

####  Framework :
      Jupyter notebook launched from Anacode
#### URL:
       Please download Anacode from the following link and launch jupyter Notebook from there. 
                    https://www.anaconda.com/download/  
       A tutorial on installation of Anaconda framework can be found at the link given below:   
                    https://www.youtube.com/watch?v=T8wK5loXkXg

# 2. Data types

There are various data types in Python. Some of the important types are listed below.

## 2.1 Variables

 - Python variables do not need explicit declaration to reserve memory space.
 - The declaration happens automatically when you assign a value to a variable.
 - The equal sign = is used to assign values to variables.
  
  Some examples are given as follows:

In [1]:
area = 200.30  #float type variable 
print (area)

200.3

In [2]:
type(area)

float

In [3]:
Distance = 100 #integer type variabe
print(Distance)

100

In [4]:
name = "Saima" #string type variable
print(name)

Saima

## 2.2 Numbers

 - This data type store numeric values
 - Numbers are immutable data types (Immutable data types means values cannot be changed after it is created)
 
  Some examples are given as follows:

In [5]:
5 #integer

5

In [6]:
10+10 #integer

20

In [7]:
5.5+5.5 #float

11.0

In [8]:
5**2 #exponent

25

## 2.3 Strings

 - Strings in Python are identified as a contiguous set of characters represented in the quotation marks.
 - Python allows either pair of single or double quotes. 
 - Strings are immutable.
 - Python doesn't support Char data type.It will beas string of length one in python.

In [9]:
Course="Data Science"
print(Course)

Data Science

In [10]:
University="Superior"
print(University)

Superior

In [11]:
sentence="this is my first ML Assignment"
print(sentence)

this is my first ML Assignment

### Access values in strings

 - we can access a specific character or range of characters from strings.
 - Subsets of strings can be taken using the slice operator [] and [:] with indexes starting from 0.
 
 Some examples are listed below:

In [12]:
str="First machine learning assignment"
print (str) #print complete string
print (str[0])       # Prints first character of the string
print (str[3:5])     # Prints characters starting from 4th to 5th
print (str[3:])      # Prints string starting from 4th character
print (str[:2])      # prints first two characters
print (str[:])

First machine learning assignment
F
st
st machine learning assignment
Fi
First machine learning assignment

In [13]:
del str

str

### Updating string

 - Value of string can be changed or updated by assigning a new value to it.
 - New value must have same data type as previous value.
 - For this purpose '+' operator is used as follows:

In [14]:
stringvalue ="First assignment "
print ("old string:", stringvalue)

stringvalue =stringvalue[:6] + "Tutorial"
print ("updated string:",stringvalue)

old string: First assignment
updated string: First Tutorial

In [15]:
stringvalue ="First assignment "
print ("old string:", stringvalue)

stringvalue =stringvalue[:17] + "Tutorial"
print ("updated string:",stringvalue)

old string: First assignment
updated string: First assignment Tutorial

In [16]:
stringvalue ="First assignment "
print ("old string:", stringvalue)

stringvalue =stringvalue[0:0] + "Tutorial"
print ("updated string:",stringvalue)

old string: First assignment
updated string: Tutorial


### Delete string

 - we can delete the value of string by just deleteing its object.
 - 'del' keyword is used for this purpose
 
  It would be cleared by using following example:

In [18]:
stringvalue ="First assignment "
print (stringvalue)
del stringvalue
#print (stringvalue)

First assignment

### String special operators

 - some special operators are used in Python to perform different opertions.
   These are given below:

#### String Concatenation

 - To concatenate the strings we used '+' operator.
 
    Following are the examples of concatenation:

In [19]:
stringvalue1="machine"
stringvalue2="learning"
print(stringvalue1+stringvalue2)

machinelearning

In [20]:
stringvalue="machine"
print(stringvalue+"learning")

machinelearning

In [21]:
"machine"+"learning"

'machinelearning'

#### Repitition

 - '*' symbol is used for repitition.

In [22]:
stringvalue="Assignment"
print(stringvalue*2)

AssignmentAssignment

In [23]:
stringvalue="Assignment"
print(stringvalue*0)

In [24]:
stringvalue="Assignment"
print(stringvalue*5)

AssignmentAssignmentAssignmentAssignmentAssignment

#### Use of [] symbol

 - '[]'symbol give the character of string at given index.

In [25]:
Stringvalue="Machine Learning"
print(Stringvalue[1])

a

In [26]:
Stringvalue="Machine Learning"
print(Stringvalue[0])

M

In [27]:
Stringvalue="Machine Learning"
print(Stringvalue[7])

#### Use of [:] symbol

 - [:] is used to get substring from string.

In [28]:
stringvalue="I am hungry"
print(stringvalue [0:4])

I am

In [29]:
stringvalue="I am hungry"
print(stringvalue [5:])

hungry

In [30]:
stringvalue="I am hungry"
print(stringvalue [:2])

I

#### use of 'in'

 - 'in' is used to check the existance of character in string.
 - It returns TRUE if given character exist in string,otherwise FALSE.

In [31]:
Stringvalue="COCACOLA"
print('C' in Stringvalue)

True

In [32]:
Stringvalue="COCACOLA"
print('A' in Stringvalue)

True

In [33]:
Stringvalue="COCACOLA"
print('P' in Stringvalue)

False

#### Use of "not in"

 - 'not in' returns true if given character is not in string,otherwise false.

In [34]:
Stringvalue="COCACOLA"
print('C' not in Stringvalue)

False

In [35]:
Stringvalue="COCACOLA"
print('A' not in Stringvalue)

False

In [36]:
Stringvalue="COCACOLA"
print('P' not in Stringvalue)

True

### String formatting operator

 - Python uses C-style string formatting to create new, formatted strings.
 - The "%" operator is used to format in print statement.

See following examples:

In [37]:
print("I am %s" %("saima"))

I am saima

In [38]:
print("today is %d august" %(10))

today is 10 august

In [39]:
print ("%d + %d is %s"%(2,2,"four"))

2 + 2 is four

## 2.4 Lists

 - Lists are the most versatile of Python's compound data types.
 - Multiple types of data can be stored in a list.
 - A list contains items separated by commas and enclosed within square brackets [].
 - To some extent, lists are similar to arrays in C.One difference between them is that all the items belonging to a list can be    of different data type.
 - The plus + sign is the list concatenation operator, and the asterisk ∗ is the repetition operator.

In [40]:
list = [ 'Saima', 'maryam' , 'mahrukh', 'sara', 'Ifrah', 'Tuba' ]

print (list) # Prints complete list

['Saima', 'maryam', 'mahrukh', 'sara', 'Ifrah', 'Tuba']

In [41]:
list = [ 'Saima', 1, 'maryam',2, 'mahrukh', 3,'sara', 4,'Ifrah',5, 'Tuba' ]

print (list) # Prints complete list

['Saima', 1, 'maryam', 2, 'mahrukh', 3, 'sara', 4, 'Ifrah', 5, 'Tuba']

In [42]:
list = [ 'Saima', 'maryam' , 'mahrukh', 'sara', 'Ifrah', 'Tuba' ]
list2 = [123, 456]
print (list) # Prints complete list
print (list2 * 2) # Prints list two times
print (list + list2) # Prints concatenated lists

['Saima', 'maryam', 'mahrukh', 'sara', 'Ifrah', 'Tuba']
[123, 456, 123, 456]
['Saima', 'maryam', 'mahrukh', 'sara', 'Ifrah', 'Tuba', 123, 456]

### Accessing values in list

 - The values stored in a list can be accessed using the slice operator []and[:] with indexes starting at
   0 in the beginning of the list

In [43]:
list = [ 'Saima', 'maryam' , 'mahrukh', 'sara', 'Ifrah', 'Tuba' ]
print (list) # Prints complete list
print (list[0]) # Prints first element of the list
print (list[1:3]) # Prints elements starting from 2nd till 3rd
print (list[2:]) # Prints elements starting from 3rd element

['Saima', 'maryam', 'mahrukh', 'sara', 'Ifrah', 'Tuba']
Saima
['maryam', 'mahrukh']
['mahrukh', 'sara', 'Ifrah', 'Tuba']

In [44]:
list1 =[1,2,3,4,5]
list2=['mon','tue','wed']
print("list1[2] " ,list1[2])
print("list2[0] " ,list2[0])

list1[2]  3
list2[0]  mon

In [45]:
list1 =[1,2,3,4,5]
print("list1[0:2] " ,list1[0:2])

list1[0:2]  [1, 2]

### Updating list

 - Value of string can be changed or updated by assigning a new value to it.
 - we can update single or multiple elements of a list by giving slice on left hand of the assignment operator.
 - we can also update list by using append() function.

In [46]:
list1=["dell","Hp","Apple","Ali"]
list1[3]="samsung"
print(list1)

['dell', 'Hp', 'Apple', 'samsung']

In [47]:
list1=["dell","Hp","Apple","Ali"]
list1.append("samsung")
print(list1)

['dell', 'Hp', 'Apple', 'Ali', 'samsung']

In [48]:
list1=["dell","Hp","Apple","Ali"]
list1.append("samsung")
list1.append('1')
print(list1)

['dell', 'Hp', 'Apple', 'Ali', 'samsung', '1']

### Delete List Element

- we can delete the element of list by using del keyword or remove()function.
- 'del' keyword is used when you know the position or index of element to be deleted.
- remove() function can be used when you don't know the postion of element to be removed.
 
  It would be cleared by using following example:

In [49]:
list = [ 'Saima', 'maryam' , 'mahrukh', 'sara', 'Ifrah', 'Tuba' ]
print (list) # Prints complete list
del list[3]
print("after deleting the value ")
print (list)

['Saima', 'maryam', 'mahrukh', 'sara', 'Ifrah', 'Tuba']
after deleting the value
['Saima', 'maryam', 'mahrukh', 'Ifrah', 'Tuba']

In [50]:
list = [ 'Saima', 'maryam' , 'mahrukh', 'sara', 'Ifrah', 'Tuba' ]
print (list) # Prints complete list
del list[2]
del list[0]
print("After deleting the values")
print (list)

['Saima', 'maryam', 'mahrukh', 'sara', 'Ifrah', 'Tuba']
After deleting the values
['maryam', 'sara', 'Ifrah', 'Tuba']

## 2.5 Dictionaries

 - Dictionary is an unordered set of key: value pairs, with the requirement that the keys are unique (within one dictionary).
 - Each key is seperated by colon(:) from its value.
 - Each item is seperated with comma(,).
 - A pair of braces creates an empty dictionary: {}.
 - Python's dictionaries are kind of hash-table type.
 - A dictionary key can be almost any Python type, but are usually numbers or strings. Values, on the other hand, can be any       arbitrary Python object.
 - Dictionaries are enclosed by curly braces ({ }) and values can be assigned and accessed using square braces ([])
 - Dictionaries have no concept of order among elements. It is incorrect to say that the elements are "out of order"; they are simply unordered

In [51]:
dict = {}
dict['one'] = "I like yellow"
dict[2] = "I like blue"
tinydict = {'name': 'saima','code':6734, 'dept': 'CS'}
print (dict['one']) # Prints value for 'one' key
print (dict[2]) # Prints value for 2 key
print (tinydict) # Prints complete dictionary
print (tinydict.keys()) # Prints all the keys
print (tinydict.values()) # Prints all the values

I like yellow
I like blue
{'name': 'saima', 'code': 6734, 'dept': 'CS'}
dict_keys(['name', 'code', 'dept'])
dict_values(['saima', 6734, 'CS'])

## Accessing value in dictionary

- Square brackets [] along with the key are used to access its value.

In [52]:
dict = {'name': 'saima','code':6734, 'dept': 'CS'}
print (dict['name']) # Prints value for 'name' key

saima

In [53]:
dict = {'name': 'saima','code':6734, 'dept': 'CS'}
print (dict['dept']) # Prints value for 'dept' key

CS

In [54]:
dict = {'name': 'saima','code':6734, 'dept': 'CS'}
print (dict['name'])
print(dict['code'])

saima
6734

### Updating Dictionary

- we can update values in dictionary 
- we can also add new values in dictionary

Some examples are given below:

In [55]:
dict ={'City': 'Lahore','code': 42 , 'Town': 'Johar town'}
print(dict)
print("After changing Town value")
dict['Town']="Bahria town"
print(dict)

{'City': 'Lahore', 'code': 42, 'Town': 'Johar town'}
After changing Town value
{'City': 'Lahore', 'code': 42, 'Town': 'Bahria town'}

In [56]:
dict ={'City': 'Lahore','code': 42 , 'Town': 'Johar town'}
print(dict)
print("After changing code value")
dict['code']="40"
print(dict)

{'City': 'Lahore', 'code': 42, 'Town': 'Johar town'}
After changing code value
{'City': 'Lahore', 'code': '40', 'Town': 'Johar town'}

In [57]:
dict ={'City': 'Lahore','code': 42 , 'Town': 'Johar town'}
print(dict)
print("After adding new value")
dict['weather']="Hot"
print(dict)

{'City': 'Lahore', 'code': 42, 'Town': 'Johar town'}
After adding new value
{'City': 'Lahore', 'code': 42, 'Town': 'Johar town', 'weather': 'Hot'}

### Delete Dictionary element

- we can delete elements of dictionary as well as complete content of dictionary.
- To delete single element del keyword is used.
- clear() function  is used to remove complete dictionary.

 Some examples are as follows:

In [58]:
dict ={'City': 'Lahore','code': 42 , 'Town': 'Johar town'}
print(dict)
del dict['Town']
print(dict)

{'City': 'Lahore', 'code': 42, 'Town': 'Johar town'}
{'City': 'Lahore', 'code': 42}

In [59]:
dict ={'Friend': 'Aisha','Color': 'purple' , 'Town': 'Johar town'}
print(dict)
del dict['Friend']
print(dict)

{'Friend': 'Aisha', 'Color': 'purple', 'Town': 'Johar town'}
{'Color': 'purple', 'Town': 'Johar town'}

In [60]:
dict ={'Friend': 'Aisha','Color': 'purple' , 'Town': 'Johar town'}
print(dict)
dict.clear()
print(dict)

{'Friend': 'Aisha', 'Color': 'purple', 'Town': 'Johar town'}
{}

## 2.6 Tuples

 - A tuple is another sequence data type that is similar to the list.
 - A tuple consists of a number of values separated by commas. Unlike lists, however, tuples are enclosed within parenthesis.
 - The main difference between lists and tuples are − Lists are enclosed in brackets ( [ ] ) and their elements and size can be  changed, while tuples are enclosed in parentheses ( ( ) ) and cannot be updated. Tuples can be thought of as read-only lists.   
 - It can also have multiple data type values.
 
  For example:

In [61]:
tuple = ( 'aisha','saima' , 'faiza', 'saira')

print (tuple)           # Prints complete tuple

('aisha', 'saima', 'faiza', 'saira')

In [62]:
tuple = ( 'aisha','saima' , '20', 'saira40')

print (tuple)           # Prints complete tuple

('aisha', 'saima', '20', 'saira40')

In [63]:
tuple = ( 'aisha','saima' , 'faiza', 'saira')
tuple1 = (1,2,3,4)
print (tuple)           # Prints complete tuple
print (tuple1)

('aisha', 'saima', 'faiza', 'saira')
(1, 2, 3, 4)

### Accessing values in Tuples

- Square brackets [] along with the index are used to access its value.

In [64]:
tuple = ( 'aisha','saima' , '20', 'saira40')

print (tuple)           # Prints complete tuple
print(tuple[1])  #print value at 1st index

('aisha', 'saima', '20', 'saira40')
saima

In [65]:
tuple =('saima','maryam','Mahrukh','sara','Ifrah',"tuba")
print (tuple)           # Prints complete tuple
print (tuple[0])        # Prints first element of the tuple
print (tuple[1:3])      # Prints elements starting from 2nd till 3rd 
print (tuple[2:])       # Prints elements starting from 3rd element

('saima', 'maryam', 'Mahrukh', 'sara', 'Ifrah', 'tuba')
saima
('maryam', 'Mahrukh')
('Mahrukh', 'sara', 'Ifrah', 'tuba')

### Updating Tuples

- Tuples are immutable means we cannot change the value of tuple.
- It is read only.
- we are able to take portions of tuples to make a new tuple.

In [66]:
tuple1=('sun','mon','tue','wed','thur','fri' , 'sat')
tuple2=(1,2,3,4,5,6,7)
print(tuple1)
print(tuple2)
tuple3=(tuple1+tuple2)
print(tuple3)

('sun', 'mon', 'tue', 'wed', 'thur', 'fri', 'sat')
(1, 2, 3, 4, 5, 6, 7)
('sun', 'mon', 'tue', 'wed', 'thur', 'fri', 'sat', 1, 2, 3, 4, 5, 6, 7)

### Delete tuple elements

- we cannot delete single elements of tuple because they cannot be updated.
- To delete entire elements del keyword is used.

 Some examples are as follows:

In [68]:
tuple1=('sun','mon','tue','wed','thur','fri' , 'sat')
tuple2=(1,2,3,4,5,6,7)
print(tuple1)
print(tuple2)
del(tuple1)
#print(tuple1)

('sun', 'mon', 'tue', 'wed', 'thur', 'fri', 'sat')
(1, 2, 3, 4, 5, 6, 7)

# 2.7 Sets

 - A set is an unordered collection in which each value occurs at most once.
 - You can use curly braces to give an expression whose value is a set. 
 - Python prints sets using curly braces.
 - Every value in a set is immutable but the set itself is immutable we can add o remove items from it.
 - Sets can be used to perform mathematical operations like union,intersection,etc
 - Empty set will be written as {}.
 - We can also make a set from a list using set() function.
 - Data type can be found using type() function.
 - add() is used to add single value, update() is used for adding multiple values.
 - update() function can take tuple,string,list or other set as argument.
 - discard() and remove() are used to delete specific item from list.
 - discard() will not raise an error if item doesn't exist.
 - remove() will raise an error if item doesn't exist in set.
 - The cardinality of a set S is the number of elements in the set.
 - In Python, the cardinality of a set is obtained using the function len(·).

In [69]:
set1={1,2,3}
print(set1)

{1, 2, 3}

In [70]:
set2={'Ali','Asad','Abdullah',1.0,1,2,3}
print(set2)

{1.0, 2, 3, 'Asad', 'Abdullah', 'Ali'}

In [71]:
set1 = {1,2,3,4,3,2}    #set do not have duplicate values
print(set1)

set2 = set([1,2,3,2])
print(set2)

{1, 2, 3, 4}
{1, 2, 3}

### empty set
- Creating an empty set is a bit tricky.
- Empty curly braces {} will make an empty dictionary in Python. 
- To make a set without any elements we use the set() function without any argument.

In [72]:

a = {}

# check data type of a
# Output: <class 'dict'>
print(type(a))

# initialize a with set()
a = set()

# check data type of a
# Output: <class 'set'>
print(type(a))

<class 'dict'>
<class 'set'>

### Add elements in sets

In [73]:
set1= {'saima','iqra','eman','zee'}
print(set1)

set1.add('taimoor')
print(set1)


set1.update(['Kaleem','Ali'])
print(set1)

{'iqra', 'zee', 'eman', 'saima'}
{'iqra', 'saima', 'taimoor', 'zee', 'eman'}
{'iqra', 'Kaleem', 'saima', 'Ali', 'taimoor', 'zee', 'eman'}

### Remove elements from set

In [74]:
set1= {'saima','iqra','eman','zee'}
print(set1)

set1.remove('zee')
print(set1)

{'iqra', 'zee', 'eman', 'saima'}
{'iqra', 'eman', 'saima'}

In [78]:
set1= {'saima','iqra','eman','zee'}
print(set1)

set1.remove('iqra')
print(set1)

{'iqra', 'zee', 'eman', 'saima'}
{'zee', 'eman', 'saima'}

In [79]:
set1= {'saima','iqra','eman','zee'}
print(set1)

set1.discard('zee')
print(set1)

{'iqra', 'zee', 'eman', 'saima'}
{'iqra', 'eman', 'saima'}

In [80]:
set1= {'saima','iqra','eman','zee'}
print(set1)

set1.discard('taimoor')
print(set1)

{'iqra', 'zee', 'eman', 'saima'}
{'iqra', 'zee', 'eman', 'saima'}

# 3.Comparison Operators

 - Comparison operators are used to compare values and return TRUE/FALSE according to the situation.
 - Python defines the following comparison operators:

### Less than operator  (<)

In [81]:
10<17

True

In [82]:
17<10

False

### Less than equal to operator (<=)

In [83]:
15<=10

False

In [84]:
10<=15

True

In [85]:
10<=10

True

### Equal to operatoe (==)

In [86]:
16==16

True

In [87]:
17==18

False

In [88]:
'Mehwish'=='Saima'

False

In [89]:
"Saima"=="saima"

False

In [90]:
"ALI"=="ALI"

True

### Not equal to operator (!=)

In [91]:
3!=5

True

In [92]:
3!=3

False

In [93]:
"aisha"!="faiza"

True

In [94]:
"aisha"!="aisha"

False

### OR Operator

In [95]:
(10==10)or(10<17)

True

In [96]:
(10!=10)or(10>19)

False

### And operator

In [97]:
(10==10)and (10<17)

True

In [98]:
(10!=10) and(10==10)

False

# 4.If else statement

 - The if–else is used to make choices in Python code.
 - This is a compound statement. 
 - The syntax is:
 - if c o n d i t i o n 
          action −1
  else :
          action −2
 - The indentation is required

In [99]:
x = 3
if x > 0:
     print (" sunday is wonderful")
else :
     print (" Monday is Good ")

 sunday is wonderful

In [100]:
x = -5
if x > 0:
     print (" sunday is wonderful")
else :
     print (" Monday is Good ")

 Monday is Good

In [101]:
x = 27
if x > 0:
     print (" number is positive")
else :
     print (" number is negative ")

 number is positive

In [102]:
x = -8
if x > 0:
     print (" number is positive")
else :
     print (" number is negative ")

 number is negative

# 5. For and while loop

- Python has for and while loop for iteration,used when we want to perfrom a specific task repeatedly.

### For loop

- The for statement is used to iterate over the elements of a sequence. 
- It's traditionally used when you have a piece of code which you want to repeat n number of time.
- The syntax of a for loop is:

    for item in list :
      a c t i o n
- As usual, the action consists of one or more statements, all at the same indentation level. These statements are also known as the body of the loop. The item is a variable name, and list is a list.
- Execution of the for loop works by setting the variable successively to each item in the list, and then executing the body each time.

  Here is a simple example:

In [103]:
for i in [2 , 4 , 6 , 0]:
    print(i)

2
4
6
0

In [104]:
for counter in range(1, 6):
    print (counter)

1
2
3
4
5

In [119]:
word = "saima"
for letter in word:
    print (letter)

s
a
i
m
a

### While loop

 - The while loop tells the computer to do something as long as the condition is met. 
 - Its construct consists of a block of code and a condition. 
 - The condition is evaluated, and if the condition is true, the code within the block is executed. 
 - This repeats until the condition becomes false. 
 
 Some examples are given below:

In [106]:
a = 0
while a < 10:
   a = a +2
   print (a)

2
4
6
8
10

In [107]:

n = 10
sum = 0
i = 1

while i <= n:
    sum = sum + i
    i = i+1    # update counter

# print the sum
print("The sum is", sum)

The sum is 55

In [120]:
counter = 0

while counter < 3:
    print("Inside loop")
    counter = counter + 1
else:
    print("Inside else")

Inside loop
Inside loop
Inside loop
Inside else

# Functions

 - You use functions in programming to bundle a set of instructions that you want to use repeatedly or that, because of their  complexity, are better self-contained in a sub-program and called when needed.                                 
 - Function is a piece of code written to carry out a specified task. 
 - There are three types of functions in Python:
 - Built-in functions, such as help() to ask for help, min() to get the minimum value, print() to print an object.
 - User-Defined Functions (UDFs), which are functions that users create to help them out.
 - Anonymous functions, which are also called lambda functions because they are not declared with the standard def keyword.
 - The syntax is:
 
   def functionname(parameters)
    
   "function_docstring"
   
   function_suite
   
   return [expression]

In [109]:
def my_function():
    print("Hello from a function")

my_function()

Hello from a function

In [110]:
def my_function(fname):
     print(fname + " shoukat")

my_function("saima")
my_function("aisha")
my_function("faiza")

saima shoukat
aisha shoukat
faiza shoukat

In [111]:
def my_function(country = "pakistan"):
    print("I am from " + country)

my_function("Sweden")
my_function("India")
my_function()
my_function("Brazil")

I am from Sweden
I am from India
I am from pakistan
I am from Brazil

# 7. Lambda Functions

 - The creation of anonymous functions at runtime,using a construct called "lambda"
 - A lambda function is a small anonymous function.
 - A lambda function can take any number of arguments, but can only have one expression.
 - Lambda function does not include return statement,it always contains an expression which is returned.
 - You might want to use lambdas when you don’t want to use a function twice in a program.

   some examples are given:

In [112]:
add = lambda x, y: x + y

print(add(3, 5))

8

In [122]:
a = [(1, 2), (4, 1), (9, 10), (13, -3)]
a.sort(key=lambda x: x[1])
type(a)
print(a)
type(a)

[(13, -3), (4, 1), (1, 2), (9, 10)]

list

In [114]:
multiply = lambda x, y: x * y

print(multiply(3, 5))

15

## 7.1 Map()

 - Map() function is used with two arguments.Just like: r=map(func,seq)
 - The first argument func is function name and the second is a sequence(list etc)
 - Map functions expects a function object and any number of iterables like list, dictionary, etc. 
 - It executes the function_object for each element in the sequence and returns a list of the elements modified by the function  object.

   Example:

In [115]:
for ch in map(chr,[65,66,67,68]):
    print(ch)

A
B
C
D

In [117]:
sentence="it is first machine learning assignment"
words=sentence.split()
print(words)

lengths= map(lambda word:len(word),words)
#list[lengths]

['it', 'is', 'first', 'machine', 'learning', 'assignment']

In [5]:
evenumbers = [1,2,3,4,5,6,7]
def even(num):
    if num%2 == 0:
        return(num)

result = filter(even, evenumbers)
print(list(result))

[2, 4, 6]

# 7.2 Filter()

 - The filter() method filters the given iterable with the help of a function that tests each element in the iterable to be true or not.
 - The syntax of filter() method is:
      filter(function, iterable)
 - The filter() method takes two parameters:
 
      1)function - function that tests if elements of an iterable returns true or false If None, the function defaults to Identity function - which returns false if any elements are false
      
      2)iterable - iterable which is to be filtered, could be sets, lists, tuples, or containers of any iterators
 - The filter() method returns an iterator that passed the function check for each element in the iterable.

In [4]:
# list of alphabets
alphabets = ['a', 'b', 'd', 'e', 'i', 'j', 'o']

# function that filters vowels
def filterVowels(alphabet):
    vowels = ['a', 'e', 'i', 'o', 'u']

    if(alphabet in vowels):
        return True
    else:
        return False

filteredVowels = filter(filterVowels, alphabets)

print('The filtered vowels are:')
for vowel in filteredVowels:
    print(vowel)

The filtered vowels are:
a
e
i
o

In [ ]:
# random list
randomList = [1, 'a', 0, False, True, '0']

filteredList = filter(None, randomList)

print('The filtered elements are:')
for element in filteredList:
    print(element)

In [ ]:
ages = [5, 12, 17, 18, 24, 32]

def myFunc(x):
  if x < 18:
    return False
  else:
    return True

adults = filter(myFunc, ages)

for x in adults:
  print(x)

# 8.File I/O

 - In this section we will cover basic I/O functions.

# Reading input from keyboard

 -  There are two functions in Python that you can use to read data from the user:raw_input and input
 -  You can store the results from them into a variable
 -  If the input function is called, the program flow will be stopped until the user has given an input and has ended the input  with the return key. The text of the optional parameter, i.e. the prompt, will be printed on the screen. 
 
 Let's have a look at the following example:

In [ ]:
name = input("What's your name? ")
print("Nice to meet you " + name + "!")

In [ ]:
age = input("What's your age? ")
print("your age is " + age+ "!")

In [ ]:
string=input("enter your university....")
print(string)

# I/O From or to text file

 - In this scenario, we will read and write to a text file.
 - we can open files in different modes.

## Read only mode

 - r opens a file in read only mode.
 - The file pointer is placed at the beginning of the file.
 - This is the default mode.

In [ ]:

file = open("hello.txt", "r")
str=file.read();
print(str)
file.close()

## Read and write mode

 - r+ opens a file in read and write mode.
 - The file pointer placed at the beginning of the file

In [ ]:
# Open a file
file = open("hello.txt", "r+")
str = file.read(10);
print ("Read String is : ", str)
# Close opend

## Write mode only

 - w opens a file in write mode only.
 - Overwrites the file if the file exists. If the file does not exist, creates a new file for writing

In [ ]:
file = open('write.txt','w') 
file.write("This is the write command") 
file.write("It allows us to write in a particular file") 
file = open('write.txt','r') 
str=file.read()
print(str)
file.close()

## Append mode

 - a opens a file in append mode.
 - The file pointer is at the end of the file if the file exists.
 - That is, the file is in the append mode. If the file does not exist, it creates a new file for writing.

In [ ]:
file = open('write.txt','a') 
file.write("This will add this line") 
file = open('write.txt','r') 
str=file.read()
print(str)
file.close()

## Append and read mode

 - a+ opens a file in append and read mode.
 - The file pointer is at the end of the file if the file exists. The file opens in the append mode. If the file does not exist,    it creates a  new file for reading and writing.

In [ ]:
file = open('hello.txt','a+') 
file.write("MSCS From comsats university") 
file.close()
file = open('hello.txt','r') 
str=file.read()
print(str)
file.close()

## File Position

 - tells() method tells the current position within the file.
 - seek() method changes the current file method.
 - Following is the syntax for seek() method:    fileObject.seek(offset[, whence])

In [ ]:
 f = open('hello.txt',"r+")
 str=f.read(20);
print("read string is :\n",str)
          
position=f.tell();
print("current file position is :\n",position)       
          
position=f.seek(0,0);
str=f.read(10);
print("again read string is :\n",str)
f.close()

# 9.Pandas Introduction

Pandas is an open-source Python Library providing high-performance data manipulation and analysis tool using its powerful data structures. The name Pandas is derived from the word Panel Data – an Econometrics from Multidimensional data. In 2008, developer Wes McKinney started developing pandas when in need of high performance, flexible tool for analysis of data.

Prior to Pandas, Python was majorly used for data munging and preparation. It had very less contribution towards data analysis. Pandas solved this problem. Using Pandas, we can accomplish five typical steps in the processing and analysis of data, regardless of the origin of data — load, prepare, manipulate, model, and analyze.

Python with Pandas is used in a wide range of fields including academic and commercial domains including finance, economics, Statistics, analytics, etc.

#### Key Features of Pandas

-  Fast and efficient DataFrame object with default and customized indexing.
-  Tools for loading data into in-memory data objects from different file formats.
-  Data alignment and integrated handling of missing data.
-  Reshaping and pivoting of date sets.
- Label-based slicing, indexing and subsetting of large data sets.
- Columns from a data structure can be deleted or inserted.
- Group by data for aggregation and transformations.
- High performance merging and joining of data.
- Time Series functionality.

Pandas deals with the following three data structures:
- Series
- DataFrame
- Panel

These data structures are built on top of Numpy array, which means they are fast.

# 10.Series

- The Series is a one-dimensional array that can store various data types, including mix data types. 
- The row labels in a Series are called the index. 
- Any list, tuple and dictionary can be converted in to Series using ‘series’ method
- Basic method to create a series: s = pd.Series(data, index = index)
- Series is size immutable.

In [1]:
import pandas as pd
s = pd.Series([1, 'Lahore', 2, 3, 'Happy Eating!'])
s

0                1
1           Lahore
2                2
3                3
4    Happy Eating!
dtype: object

## 10.1 Series creation from ndarray

- Index must be of same length as data. If no index is passed, it will automatically be [0, ..., len(data) - 1]

In [3]:
first_series = pd.Series([1,2,4,8,16,32,64])
print(type(first_series))
print(first_series)

<class 'pandas.core.series.Series'>
0     1
1     2
2     4
3     8
4    16
5    32
6    64
dtype: int64

In [4]:
import pandas as pd
import numpy as np
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
print(s)
print('-'*50)
print(s.index)

a   -0.551965
b    0.189482
c    0.601404
d    0.840048
e    0.253543
dtype: float64
--------------------------------------------------
Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

## 10.2 Series creation from dict

- If Data is a dictionary, if index is passed the values in data corresponding to the labels in the index will be pulled out, otherwise an index will be constructed from the sorted keys of the dict.

In [5]:
d = {'a': 100., 'b': 200., 'c': 300.}
pd.Series(d)

a    100.0
b    200.0
c    300.0
dtype: float64

In [7]:
data = {'abc': 1, 'def': 2, 'xyz': 3}
pd.Series(data)

abc    1
def    2
xyz    3
dtype: int64

## 10.3 Series creation from a scalar value

- Index must be provided. The value will be repeated to match the length of the index

In [8]:
pd.Series(5, index = ['a', 'b', 'c'])

a    5
b    5
c    5
dtype: int64

In [9]:
 x = pd.Series(3, index=['a', 'b', 'c', 'd'])
x

a    3
b    3
c    3
d    3
dtype: int64

## 10.4 Series is ndarray-like

- Series acts similar to a numpy array, and is valid arguments to most numpy functions.
- Slicing also slices the index
- Short Intro, back to this later

In [11]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
print(s)

a    0.280772
b    1.064165
c   -0.619168
d    1.313333
e    0.490762
dtype: float64

In [15]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
print(s[2])

0.5552399005923863

In [16]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
print(s[:3])

a    0.171390
b    0.854961
c    2.132359
dtype: float64

In [17]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
print(s[[3,2,1]])

d    0.001560
c    0.061114
b   -1.389603
dtype: float64

In [18]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
np.exp(s)

a    0.652652
b    1.215783
c    0.413658
d    0.196030
e    3.169987
dtype: float64

In [19]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
s['b']

-0.5819636222653551

In [20]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
s['b']=12.
s

a     0.551288
b    12.000000
c    -1.227031
d    -3.040550
e    -1.584777
dtype: float64

In [21]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
'e' in s

True

In [22]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
'f' in s

False

## 10.5 Series is dict-like

- A Series is like a xed-size dict in that you can get and set values by index label

In [23]:
s = pd.Series([1, 2, 3, 4])
s.to_dict()

{0: 1, 1: 2, 2: 3, 3: 4}

## 10.6 Vectorized operations and label alignment with Series

- When doing data analysis,as with the row NumPy arrays looping through series value by value is usually not necessary.
- Series can also be passed into most NumPy method expecting an ndarray.
- NumPy and Pandas generalize arithmetic operations so that we can easily and quickly perform the same operation on many array elements. For example:

In [38]:
import numpy as np
x = np.array([2, 3, 5, 7, 11, 13])
x * 2

array([ 4,  6, 10, 14, 22, 26])

In [39]:
data = ['saima', 'aisha', 'faiza', 'saira']
[s.capitalize() for s in data]

['Saima', 'Aisha', 'Faiza', 'Saira']

# 11.Data Frames

- A DataFrame is a two dimensional object that can have columns with potential different types. Different kind of inputs include dictionaries, lists, series, and even another DataFrame.
- It is the most commonly used pandas object.
- You can create a series from:
    - Dict of 1D ndarrays, lists, dicts, or Series
    - 2-D numpy array
    - A list of dictionaries
    - A Series
    - Another Dataframe
  
- index/ columns is a list of the row/ column labels. If you pass an index and/ or columns, you are guarenteeing the index and /or column of the df.
- If you do not pass anything in, the input will be constructed by "common sense" rules

In [40]:
dates = pd.date_range('20130101',periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

## 11.1 Dataframe creation from dict of series or dicts

 - The index of the resulting DataFrame will be the union of the indices of the various Series. If there are any nested dicts, these will be converted to Series.
 - If no columns are passed, the columns will be the sorted list of dict keys.

In [43]:
# Create a dictionary of series
d = {'one': pd.Series([1,2,3], index = ['a', 'b', 'c']),
'two': pd.Series(list(range(4)), index = ['a','b', 'c', 'd'])}
# Columns are dictionary keys, indices and values obtained from series
df = pd.DataFrame(d)
# Notice how it fills the column one with NaN for d
print(df)

   one  two
a  1.0    0
b  2.0    1
c  3.0    2
d  NaN    3

In [44]:
 d = {'col1': [1, 2], 'col2': [3, 4]}
 df = pd.DataFrame(data=d)
 df

   col1  col2
0     1     3
1     2     4

## 11.2  Dataframe creation from dict of ndarrays/lists

 - The ndarrays must all be the same length.
 - If an index is passed, it must clearly also be the same length as the arrays. If no index is passed, the result will be range(n), where n is the array length.

In [45]:
d = {'one' : [1., 2., 3., 4.], 'two' : [4., 3., 2., 1.]}
pd.DataFrame(d)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [46]:
df2 = pd.DataFrame(np.random.randint(low=0, high=10, size=(5, 5)), columns=['a', 'b', 'c', 'd', 'e'])
df2

   a  b  c  d  e
0  5  5  8  2  2
1  3  6  2  9  4
2  4  7  9  3  9
3  7  8  3  8  6
4  8  0  1  4  1

## 11.3 Dataframe creation from a list of dicts

In [47]:
data = [{'a':10,"b":20},{'a':5,'b':10,'c':20}]
pd.DataFrame(data)

    a   b     c
0  10  20   NaN
1   5  10  20.0

In [48]:
data = [{'a':10,"b":20,"c":30},{'a':5,'b':10,'c':20}]
pd.DataFrame(data)

    a   b   c
0  10  20  30
1   5  10  20

## 11.4 Dataframe creation from a dict of tuples

 - You can automatically create a multi indexed by passing a tuple dictionary.

In [49]:

df = pd.DataFrame({'Initial': ['C','A','M'], 'Sex': ['M', 'F', 'F'], 'Age': [49, 39, 19]})
df = df[['Initial', 'Sex', 'Age']]
df

  Initial Sex  Age
0       C   M   49
1       A   F   39
2       M   F   19

In [50]:
data = [('p1', 't1', 1, 2),('p1', 't2', 3, 4),('p2', 't1', 5, 6),('p2', 't2', 7, 8),('p2', 't3', 2, 8)]

df = pd.DataFrame(data)
df

    0   1  2  3
0  p1  t1  1  2
1  p1  t2  3  4
2  p2  t1  5  6
3  p2  t2  7  8
4  p2  t3  2  8

## 11.5 Alternate constructors

### Dataframe.from_dict

 - Dataframe.from_dict takes a dict of dictsor a dict of array like sequences and returns a Dataframe.
 - It operates like the dataframe constructor except for the orient parameter which is coulmn by default,but which can be set to index in order to use the dict keys as row labels.

In [51]:
data = {"X": {'a': 1, 'b': 2, 'c': 3}, "Y": {'d': 4, 'e': 5, 'f': 6}, "Z": {'g': 7, 'h': 8, 'i': 9}}

df = pd.DataFrame.from_dict(data, orient="index").fillna(0).astype(int)
df

   a  b  c  d  e  f  g  h  i
X  1  2  3  0  0  0  0  0  0
Y  0  0  0  4  5  6  0  0  0
Z  0  0  0  0  0  0  7  8  9

### Dataframe.from_records

- Dataframe.from_records take a list of tuples or an ndarray with structured dtype.
- Works analogously to the normal dataframe constructor,except that index may be aspecific field of the structured dtype to use as the index.for example:

In [52]:
sales = [('Jones LLC', 150, 200, 50),
     ('Alpha Co', 200, 210, 90),
     ('Blue Inc', 140, 215, 95)]
labels = ['account', 'Jan', 'Feb', 'Mar']
df = pd.DataFrame.from_records(sales, columns=labels)
df

     account  Jan  Feb  Mar
0  Jones LLC  150  200   50
1   Alpha Co  200  210   90
2   Blue Inc  140  215   95

### Dataframe.from_items

- Convert (key, value) pairs to DataFrame. The keys will be the axis index (usually the columns, but depends on the specified orientation). The values should be arrays or Series.

In [53]:
df=pd.DataFrame.from_items([('A',[1,2,3]),('B',[4,5,6])] 
df

SyntaxError: invalid syntax (<ipython-input-53-c79ac6362c9f>, line 2)

## 11.6 Column selection,addition,deletion

 - You can treat a DataFrame semantically like a dict of like-indexed Series objects. Getting, setting, and deleting columns works with the same syntax as the analogous dict operations:

In [54]:
df = pd.DataFrame([[1,2],[3,4],[5,6]], columns=['a','a']) # you can adress column by index
df

   a  a
0  1  2
1  3  4
2  5  6

In [55]:
df = pd.DataFrame([[1,2],[3,4],[5,6]], columns=['a','a'])
df.columns = ['a','b']  # rename column
df

   a  b
0  1  2
1  3  4
2  5  6

In [56]:
df = pd.DataFrame([[1,2],[3,4],[5,6]], columns=['a','b'])
del df['b']   # delete column
df

   a
0  1
1  3
2  5

In [57]:
df = pd.DataFrame([[1,2],[3,4],[5,6]], columns=['a','b'])
df['c']='2'   #add new column c and fill with 2 
df

   a  b  c
0  1  2  2
1  3  4  2
2  5  6  2

### 11.7 Indexing / seletion

- Row selection, for example, returns a Series whose index is the columns of the DataFrame:
- Pandas now supports three types of Multi-axes indexing; the three types are:
    - .loc()  (label based)
    - .iloc()  (integer based)
    - .ix()    (both label and integer based)
- loc takes two single/list/range operator separated by ','. The first one indicates the row and the second one indicates columns.
- iloc(): Pandas provide various methods in order to get purely integer based indexing. Like python and numpy, these are 0-based indexing.
- ix(): Besides pure label based and integer based, Pandas provides a hybrid method for selections and subsetting the object using the .ix() operator.

#### .loc()

In [58]:
df = pd.DataFrame(np.random.randn(8, 4),
index = ['a','b','c','d','e','f','g','h'], columns = ['A', 'B', 'C', 'D'])

#select all rows for a specific column
print (df.loc[:,'A'])

a   -1.585144
b    1.839715
c    0.113069
d   -0.474118
e    0.414863
f   -0.419790
g    1.660433
h    1.868458
Name: A, dtype: float64

In [59]:
df = pd.DataFrame(np.random.randn(8, 4),
index = ['a','b','c','d','e','f','g','h'], columns = ['A', 'B', 'C', 'D'])

# Select all rows for multiple columns, say list[]
print (df.loc[:,['A','C']])

          A         C
a  0.238825  1.522507
b -0.135751  0.771599
c  1.276903 -0.985238
d -0.313273 -2.238895
e  0.476751 -1.283074
f -1.046410 -0.009993
g  1.106337 -0.010303
h -2.045585  0.161990

In [60]:
df = pd.DataFrame(np.random.randn(8, 4),
index = ['a','b','c','d','e','f','g','h'], columns = ['A', 'B', 'C', 'D'])

# Select range of rows for all columns
print (df.loc['a':'h'])

          A         B         C         D
a -0.987625 -0.614402  0.421424  0.091799
b  0.195267 -0.151838 -1.383445 -0.432494
c -2.029380  0.816268 -0.316693  0.406832
d  1.002414 -0.124837 -0.652280  1.336706
e -0.049376  0.631406  1.107991  0.386225
f -0.397264 -0.651546  0.349369  0.904006
g  0.924724 -1.002651 -0.035317 -0.301312
h  0.090238 -0.766060 -2.071113  2.023444

#### .iloc()

In [61]:
df = pd.DataFrame(np.random.randn(8, 4), columns = ['A', 'B', 'C', 'D'])

# select all rows for a specific column
print (df.iloc[:4])

          A         B         C         D
0 -0.049859 -0.505378  0.827175 -1.569593
1  0.405939  0.461731  0.143122  2.090763
2  1.006015  1.321701  0.499308 -0.140854
3 -0.768487  0.787366 -0.436671  0.238251

In [62]:
df = pd.DataFrame(np.random.randn(8, 4), columns = ['A', 'B', 'C', 'D'])

# Integer slicing
print (df.iloc[:4])
print (df.iloc[1:5, 2:4])

          A         B         C         D
0  0.266616 -1.235998 -0.258703 -0.619371
1  0.830907 -0.563891  1.310306  0.314341
2  0.248071 -1.056747 -0.976155 -1.490154
3 -1.195785 -1.142800 -0.319380  0.440875
          C         D
1  1.310306  0.314341
2 -0.976155 -1.490154
3 -0.319380  0.440875
4  0.835726  0.245500

#### .ix()

In [65]:
df = pd.DataFrame(np.random.randn(8, 4), columns = ['A', 'B', 'C', 'D'])

# Integer slicing
print (df.ix[:4])

          A         B         C         D
0  0.351160  1.210946 -0.246993 -0.843313
1  1.919966  0.792255 -1.275772 -0.051818
2  0.047541  1.068603  0.538846  0.156707
3  1.386511 -0.789946  1.486060 -0.263218
4 -0.263279  0.445241 -1.041390  1.366172

C:\Users\asimz\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  after removing the cwd from sys.path.

In [66]:
df = pd.DataFrame(np.random.randn(8, 4), columns = ['A', 'B', 'C', 'D'])
# Index slicing
print (df.ix[:,'A'])

0   -0.539808
1   -1.268438
2   -0.960376
3    2.053766
4   -2.069716
5    1.430078
6   -2.021728
7    1.564304
Name: A, dtype: float64

C:\Users\asimz\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  This is separate from the ipykernel package so we can avoid doing imports until

## 11.8 Data alignment and arithmetic

 - Data alignment between DataFrame objects automatically align on both the columns and the index (row labels).
 - Again, the resulting object will have the union of the column and row labels.

In [67]:
df1 = pd.DataFrame(np.random.randn(10, 4), columns=['A', 'B', 'C', 'D'])
df1

          A         B         C         D
0 -0.706848 -0.164683 -0.313119  0.826422
1 -1.201147 -0.401738  1.184794 -0.755277
2 -0.255235  1.682615  1.351403 -0.985751
3 -0.273605  1.831369  1.802428 -1.284894
4  1.411008  0.041297  0.477311 -0.412690
5 -0.573527  1.790784 -0.002766 -0.427555
6  1.488758 -0.608915  0.244012 -1.544006
7  0.769601 -0.233448 -0.321180  0.438007
8  1.055844 -0.705792  1.014682 -1.477092
9  1.284357 -0.100287 -0.596891  0.098495

In [68]:

df2 = pd.DataFrame(np.random.randn(7, 3), columns=['A', 'B', 'C'])
df2

          A         B         C
0  0.185939  0.283521 -1.502630
1  1.783803  0.301672 -1.496583
2 -2.409084 -0.046328  0.421046
3  0.103719  2.199362  1.846489
4  1.780414 -1.226884 -0.616700
5  0.291122  1.424345 -0.971244
6 -0.033569 -1.006406  2.103316

In [69]:
df1+df2

          A         B         C   D
0 -0.520909  0.118838 -1.815749 NaN
1  0.582656 -0.100067 -0.311789 NaN
2 -2.664319  1.636288  1.772449 NaN
3 -0.169886  4.030731  3.648917 NaN
4  3.191422 -1.185587 -0.139388 NaN
5 -0.282406  3.215129 -0.974010 NaN
6  1.455189 -1.615321  2.347328 NaN
7       NaN       NaN       NaN NaN
8       NaN       NaN       NaN NaN
9       NaN       NaN       NaN NaN

- When doing an operation between DataFrame and Series, the default behavior is to align the Series index on the DataFrame columns, thus broadcasting row-wise. For example:

In [70]:
df1 - df1.iloc[0]

          A         B         C         D
0  0.000000  0.000000  0.000000  0.000000
1 -0.494300 -0.237055  1.497913 -1.581698
2  0.451612  1.847299  1.664521 -1.812173
3  0.433243  1.996052  2.115547 -2.111316
4  2.117855  0.205980  0.790430 -1.239112
5  0.133320  1.955467  0.310353 -1.253976
6  2.195605 -0.444232  0.557131 -2.370427
7  1.476449 -0.068764 -0.008062 -0.388415
8  1.762692 -0.541109  1.327800 -2.303514
9  1.991205  0.064396 -0.283772 -0.727927

 - In the special case of working with time series data, and the DataFrame index also contains dates, the broadcasting will be column-wise:

In [71]:
index = pd.date_range('1/1/2000', periods=8)
df = pd.DataFrame(np.random.randn(8, 3), index=index, columns=list('ABC'))
df

                   A         B         C
2000-01-01 -0.816336  2.189921 -0.079652
2000-01-02 -0.375159 -0.994864  0.040888
2000-01-03 -0.722807 -0.313458 -1.186940
2000-01-04  0.258374  0.029092 -0.248501
2000-01-05  2.451004 -1.044096  1.258090
2000-01-06  1.440715  2.421349 -0.245622
2000-01-07 -1.122079 -1.081946 -0.863566
2000-01-08 -0.711683 -1.419379 -0.107179

In [72]:
df1* 10 + 2

           A          B          C          D
0  -5.068477   0.353166  -1.131185  10.264215
1 -10.011473  -2.017384  13.847942  -5.552766
2  -0.552352  18.826154  15.514029  -7.857512
3  -0.736048  20.313687  20.024281 -10.848942
4  16.110077   2.412967   6.773114  -2.126904
5  -3.735273  19.907836   1.972344  -2.275549
6  16.887578  -4.089152   4.440124 -13.440057
7   9.696010  -0.334478  -1.211804   6.380066
8  12.558439  -5.057923  12.146818 -12.770923
9  14.843573   0.997126  -3.968907   2.984948

In [73]:
1/df1

          A          B           C          D
0 -1.414732  -6.072258   -3.193679   1.210036
1 -0.832537  -2.489182    0.844028  -1.324018
2 -3.917955   0.594313    0.739972  -1.014455
3 -3.654907   0.546040    0.554807  -0.778274
4  0.708713  24.215019    2.095068  -2.423124
5 -1.743596   0.558415 -361.584711  -2.338881
6  0.671701  -1.642265    4.098153  -0.647666
7  1.299375  -4.283613   -3.113515   2.283071
8  0.947110  -1.416847    0.985531  -0.677006
9  0.778600  -9.971339   -1.675348  10.152821

In [74]:
df1**5

          A             B             C         D
0 -0.176453 -1.211292e-04 -3.009843e-03  0.385486
1 -2.500238 -1.046446e-02  2.334611e+00 -0.245771
2 -0.001083  1.348728e+01  4.507380e+00 -0.930758
3 -0.001533  2.060055e+01  1.902347e+01 -3.502166
4  5.593026  1.201091e-07  2.477474e-02 -0.011971
5 -0.062054  1.841686e+01 -1.617893e-13 -0.014288
6  7.313415 -8.371126e-02  8.650858e-04 -8.774946
7  0.269978 -6.933441e-04 -3.417788e-03  0.016121
8  1.312196 -1.751397e-01  1.075596e+00 -7.031341
9  3.494856 -1.014455e-05 -7.576598e-02  0.000009

- Boolean operators work as well:

In [75]:
df1 = pd.DataFrame({'a' : [1, 0, 1], 'b' : [0, 1, 1] }, dtype=bool)
df1

       a      b
0   True  False
1  False   True
2   True   True

In [76]:
df2 = pd.DataFrame({'a' : [0, 1, 1], 'b' : [1, 1, 0] }, dtype=bool)
df2

       a      b
0  False   True
1   True   True
2   True  False

In [77]:
df1&df2

       a      b
0  False  False
1  False   True
2   True  False

In [78]:
df1 | df2

      a     b
0  True  True
1  True  True
2  True  True

In [79]:
df1^df2

       a      b
0   True   True
1   True  False
2  False   True

In [80]:
-df1

       a      b
0  False   True
1   True  False
2  False  False

## 11.9 transposing

- To transpose, access the T attribute (also the transpose function), similar to an ndarray:

In [81]:
# only show the first 4 rows
df[:4].T

   2000-01-01  2000-01-02  2000-01-03  2000-01-04
A   -0.816336   -0.375159   -0.722807    0.258374
B    2.189921   -0.994864   -0.313458    0.029092
C   -0.079652    0.040888   -1.186940   -0.248501

# 12. Viewing data

 - We can view data/ display data in different ways.
 - See the top and bottom rows of the frame.
 - Selecting the single column.
 - Selecting via[],which slices the row.
 - For getting a cross section using a label.
 - Selecting on a multi axis by label.
 - Showing label sliceing,both endpoints are included.
 - Reduction in the dimensions of the returned object.
 - For getting a scalar value.
 - For getting a fast access to a scalar.
 - Select via tha positionof the passed integers.
 - By integer slicing,acting similar to numpy/python.
 - By lists of integer position locations,similar to numpy/python.
 - For slicing rows explicitly.
 - For slicing column expicitly.
 - For getting a value explicitly.
 - For getting a fast access to a scalar.
 - Using a single column's values to select data.
 - selecting values from a dataframe where a boolean  condition is met.
 - Using the isin() method for filtering.

In [82]:
df.head() #display first 5 records

                   A         B         C
2000-01-01 -0.816336  2.189921 -0.079652
2000-01-02 -0.375159 -0.994864  0.040888
2000-01-03 -0.722807 -0.313458 -1.186940
2000-01-04  0.258374  0.029092 -0.248501
2000-01-05  2.451004 -1.044096  1.258090

In [83]:
df.tail(2) # display last three records

                   A         B         C
2000-01-07 -1.122079 -1.081946 -0.863566
2000-01-08 -0.711683 -1.419379 -0.107179

In [84]:
df.index #display indexes

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08'],
              dtype='datetime64[ns]', freq='D')

In [85]:
df.columns #display columns

Index(['A', 'B', 'C'], dtype='object')

In [86]:
df.values

array([[-0.81633582,  2.18992077, -0.07965212],
       [-0.3751595 , -0.99486428,  0.04088797],
       [-0.72280654, -0.31345769, -1.18693983],
       [ 0.25837433,  0.02909165, -0.24850131],
       [ 2.45100379, -1.04409607,  1.25808989],
       [ 1.44071541,  2.42134922, -0.24562175],
       [-1.12207871, -1.08194557, -0.86356561],
       [-0.71168336, -1.41937867, -0.10717853]])

In [87]:
df.T

,2000-01-01 00:00:00,2000-01-02 00:00:00,2000-01-03 00:00:00,2000-01-04 00:00:00,2000-01-05 00:00:00,2000-01-06 00:00:00,2000-01-07 00:00:00,2000-01-08 00:00:00
A,-0.816336,-0.375159,-0.722807,0.258374,2.451004,1.440715,-1.122079,-0.711683
B,2.189921,-0.994864,-0.313458,0.029092,-1.044096,2.421349,-1.081946,-1.419379
C,-0.079652,0.040888,-1.186940,-0.248501,1.258090,-0.245622,-0.863566,-0.107179

In [88]:
df.sort_index(axis=1,ascending=True) #sorting by an axis

                   A         B         C
2000-01-01 -0.816336  2.189921 -0.079652
2000-01-02 -0.375159 -0.994864  0.040888
2000-01-03 -0.722807 -0.313458 -1.186940
2000-01-04  0.258374  0.029092 -0.248501
2000-01-05  2.451004 -1.044096  1.258090
2000-01-06  1.440715  2.421349 -0.245622
2000-01-07 -1.122079 -1.081946 -0.863566
2000-01-08 -0.711683 -1.419379 -0.107179

In [89]:
df.sort_index(axis=1,ascending=False) #sorting by an axis

                   C         B         A
2000-01-01 -0.079652  2.189921 -0.816336
2000-01-02  0.040888 -0.994864 -0.375159
2000-01-03 -1.186940 -0.313458 -0.722807
2000-01-04 -0.248501  0.029092  0.258374
2000-01-05  1.258090 -1.044096  2.451004
2000-01-06 -0.245622  2.421349  1.440715
2000-01-07 -0.863566 -1.081946 -1.122079
2000-01-08 -0.107179 -1.419379 -0.711683

In [90]:
df.sort_values(by="C") #sorting by values

                   A         B         C
2000-01-03 -0.722807 -0.313458 -1.186940
2000-01-07 -1.122079 -1.081946 -0.863566
2000-01-04  0.258374  0.029092 -0.248501
2000-01-06  1.440715  2.421349 -0.245622
2000-01-08 -0.711683 -1.419379 -0.107179
2000-01-01 -0.816336  2.189921 -0.079652
2000-01-02 -0.375159 -0.994864  0.040888
2000-01-05  2.451004 -1.044096  1.258090

In [91]:
df.sort_values(by="B") #sorting by values

                   A         B         C
2000-01-08 -0.711683 -1.419379 -0.107179
2000-01-07 -1.122079 -1.081946 -0.863566
2000-01-05  2.451004 -1.044096  1.258090
2000-01-02 -0.375159 -0.994864  0.040888
2000-01-03 -0.722807 -0.313458 -1.186940
2000-01-04  0.258374  0.029092 -0.248501
2000-01-01 -0.816336  2.189921 -0.079652
2000-01-06  1.440715  2.421349 -0.245622

In [92]:
df.sort_values(by="A") #sorting by values

                   A         B         C
2000-01-07 -1.122079 -1.081946 -0.863566
2000-01-01 -0.816336  2.189921 -0.079652
2000-01-03 -0.722807 -0.313458 -1.186940
2000-01-08 -0.711683 -1.419379 -0.107179
2000-01-02 -0.375159 -0.994864  0.040888
2000-01-04  0.258374  0.029092 -0.248501
2000-01-06  1.440715  2.421349 -0.245622
2000-01-05  2.451004 -1.044096  1.258090

In [93]:
df.describe()

              A         B         C
count  8.000000  8.000000  8.000000
mean   0.050254 -0.026673 -0.179060
std    1.266310  1.512672  0.719370
min   -1.122079 -1.419379 -1.186940
25%   -0.746189 -1.053558 -0.402267
50%   -0.543421 -0.654161 -0.176400
75%    0.553960  0.569299 -0.049517
max    2.451004  2.421349  1.258090

In [94]:
df['A'] # selecting a single column ,which yields a series,equivalent to A

2000-01-01   -0.816336
2000-01-02   -0.375159
2000-01-03   -0.722807
2000-01-04    0.258374
2000-01-05    2.451004
2000-01-06    1.440715
2000-01-07   -1.122079
2000-01-08   -0.711683
Freq: D, Name: A, dtype: float64

In [95]:
df['B'] # selecting a single column ,which yields a series,equivalent to B

2000-01-01    2.189921
2000-01-02   -0.994864
2000-01-03   -0.313458
2000-01-04    0.029092
2000-01-05   -1.044096
2000-01-06    2.421349
2000-01-07   -1.081946
2000-01-08   -1.419379
Freq: D, Name: B, dtype: float64

In [96]:
df['C'] # selecting a single column ,which yields a series,equivalent to C

2000-01-01   -0.079652
2000-01-02    0.040888
2000-01-03   -1.186940
2000-01-04   -0.248501
2000-01-05    1.258090
2000-01-06   -0.245622
2000-01-07   -0.863566
2000-01-08   -0.107179
Freq: D, Name: C, dtype: float64

In [97]:
df[1:2] # selecting via []

                   A         B         C
2000-01-02 -0.375159 -0.994864  0.040888

In [98]:
df.loc[:,['A','C']]   #selecting by label

                   A         C
2000-01-01 -0.816336 -0.079652
2000-01-02 -0.375159  0.040888
2000-01-03 -0.722807 -1.186940
2000-01-04  0.258374 -0.248501
2000-01-05  2.451004  1.258090
2000-01-06  1.440715 -0.245622
2000-01-07 -1.122079 -0.863566
2000-01-08 -0.711683 -0.107179

In [99]:
df[df.B>0] #using a single column value to select data

                   A         B         C
2000-01-01 -0.816336  2.189921 -0.079652
2000-01-04  0.258374  0.029092 -0.248501
2000-01-06  1.440715  2.421349 -0.245622

In [100]:
df[df>0] #selecting  values from a dataframe where a boolean condtion is met

                   A         B         C
2000-01-01       NaN  2.189921       NaN
2000-01-02       NaN       NaN  0.040888
2000-01-03       NaN       NaN       NaN
2000-01-04  0.258374  0.029092       NaN
2000-01-05  2.451004       NaN  1.258090
2000-01-06  1.440715  2.421349       NaN
2000-01-07       NaN       NaN       NaN
2000-01-08       NaN       NaN       NaN